# 指昂方形指纹模块返回码字典
code_dict = {
    0: "执行成功",
    1: "数据包接收错误",
    2: "传感器上没有手指",
    3: "录入指纹图象失败",
    4: "指纹太淡",
    5: "指纹太糊",
    6: "指纹太乱",
    7: "指纹特征点太少",
    8: "指纹不匹配",
    9: "没搜索到指纹",
    10: "特征合并失败",
    11: "地址号超出指纹库范围",
    12: "从指纹库读模板出错",
    13: "上传特征失败",
    14: "模块不能接收后续数据包",
    15: "上传图象失败",
    16: "删除模板失败",
    17: "清空指纹库失败",
    18: "不能进入休眠",
    19: "口令不正确",
    20: "系统复位失败",
    21: "无效指纹图象",
    -1: "发送失败",
    -2: "接收失败"
}

# 指昂圆形指纹模块返回码字典
new_code_dict = {
    0: "处理成功",
    1: "处理失败",
    16: "与指定编号中模板的1:1比对失败",
    17: "已进行1:N比对，但相同模板不存在",
    18: "在指定编号中不存在已注册的模板",
    19: "在指定编号中已存在模板",
    20: "不存在已注册的模板",
    21: "不存在可注册的模板ID",
    22: "不存在已损坏的模板",
    23: "指定的模板数据无效",
    24: "该指纹已注册",
    25: "指纹图像质量不好",
    26: "模板合成失败",
    27: "没有进行通讯密码确认",
    28: "外部Flash烧写出错",
    29: "指定模板编号无效",
    34: "使用了不正确的参数",
    35: "超时，没有输入指纹",
    37: "指纹合成个数无效",
    38: "Buffer ID值不正确",
    40: "采集器上没有指纹输入",
    65: "指令被取消",
    -1: "发送失败"
}

# 串口设备类型
device_dict = {
    "0708": "身份RFID读卡器类",
    "0107": "条码扫描头类",
    "020a": "人体感应类"
}